<?php
$text = "Верьте аль не верьте, а жил на белом свете Федот-стрелец,
    удалой молодец. Был Федот ни красавец, ни урод, ни румян, ни бледен,
    ни богат, ни беден, ни в парше, ни в парче, а так, вообче. Служба
    у Федота — рыбалка да охота. Царю — дичь да рыба, Федоту — спасибо.
    Гостей во дворце — как семян в огурце. Один из Швеции, другой из Греции,
    третий с Гавай — и всем жрать подавай! Одному — омаров, другому — кальмаров,
    третьему — сардин, а добытчик один! Как-то раз дают ему приказ: чуть свет
    поутру явиться ко двору. Царь на вид сморчок, башка с кулачок, а злобности
    в ем — агромадный объем. Смотрит на Федьку, как язвенник на редьку.
    На Федьке от страха намокла рубаха, в висках застучало, в пузе заурчало, тут,
    как говорится, и сказке начало…";

function cleanText($text)
{
    $a = explode(' ', $text); //разбиваем строку
    $symbol = [',', '.', '!', ':', ';', '?', '...', '"', '—'];
    $format = str_replace($symbol, '', $a); // очищаем слова в массиве от символов
    $format = array_diff($format, array('')); // удаляем пустые значения в массиве (лишние пробелы)
    foreach ($format as &$value) {
        $value = mb_strtolower($value);
    }
    return $format;
}

$format = cleanText($text);
$result = count($format);
print_r(array_count_values($format));
echo "..." . PHP_EOL;
echo "Всего слов: {$result}";